<?php
/**
 * 状态码字典数据
 */
return [
    'code' => [
        0,
        10001,
        10002,
        10003,
        10004,
        10005,
    ],
    'status_name' => [
        'access' => 0,
        'errer' => 10001,
        'param_errer' => 10002,
        'insert_error' => 10003,
        'update_error' => 10004,
        'delete_error' => 10005,
    ],
    'map' => [
        0 => '成功',
        10001 => '错误',
        10002 => '参数错误',
        10003 => '添加错误',
        10004 => '更新错误',
        10005 => '删除错误',
    ],
];
